lkolbly/cmsis-svd/data/TexasInstruments/LM3S9B90.svd
        <register>
          <name>RXTYPE15</name>
          <description>USB Host Configure Receive Type Endpoint 15</description>
          <addressOffset>0x000001FC</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXTYPE15_TEP</name>
              <description>Target Endpoint Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_RXTYPE15_PROTO</name>
              <description>Protocol</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE15_PROTO_CTRL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE15_PROTO_ISOC</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE15_PROTO_BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE15_PROTO_INT</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_RXTYPE15_SPEED</name>
              <description>Operating Speed</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_RXTYPE15_SPEED_DFLT</name>
                  <description>Default</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE15_SPEED_FULL</name>
                  <description>Full</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_RXTYPE15_SPEED_LOW</name>
                  <description>Low</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL15</name>
          <description>USB Host Receive Polling Interval Endpoint 15</description>
          <addressOffset>0x000001FD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL15_TXPOLL</name>
              <description>RX Polling</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXINTERVAL15</name>
          <description>USB Host Receive Polling Interval Endpoint 15</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001FD</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXINTERVAL15_NAKLMT</name>
              <description>NAK Limit</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT1</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 1</description>
          <addressOffset>0x00000304</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT1</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT2</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 2</description>
          <addressOffset>0x00000308</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT2</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT3</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 3</description>
          <addressOffset>0x0000030C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT3</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT4</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 4</description>
          <addressOffset>0x00000310</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT4_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT5</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 5</description>
          <addressOffset>0x00000314</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT5_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT6</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 6</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT6_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT7</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 7</description>
          <addressOffset>0x0000031C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT7_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT8</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 8</description>
          <addressOffset>0x00000320</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT8_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT9</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 9</description>
          <addressOffset>0x00000324</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT9_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT10</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 10</description>
          <addressOffset>0x00000328</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT10_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT11</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 11</description>
          <addressOffset>0x0000032C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT11_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT12</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 12</description>
          <addressOffset>0x00000330</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT12_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT13</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 13</description>
          <addressOffset>0x00000334</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT13_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT14</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 14</description>
          <addressOffset>0x00000338</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT14_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RQPKTCOUNT15</name>
          <description>USB Request Packet Count in Block Transfer Endpoint 15</description>
          <addressOffset>0x0000033C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RQPKTCOUNT15_COUNT</name>
              <description>Block Transfer Packet Count</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXDPKTBUFDIS_EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP8</name>
              <description>EP8 RX Double-Packet Buffer Disable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP9</name>
              <description>EP9 RX Double-Packet Buffer Disable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP10</name>
              <description>EP10 RX Double-Packet Buffer Disable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP11</name>
              <description>EP11 RX Double-Packet Buffer Disable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP12</name>
              <description>EP12 RX Double-Packet Buffer Disable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP13</name>
              <description>EP13 RX Double-Packet Buffer Disable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP14</name>
              <description>EP14 RX Double-Packet Buffer Disable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP15</name>
              <description>EP15 RX Double-Packet Buffer Disable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXDPKTBUFDIS_EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP8</name>
              <description>EP8 TX Double-Packet Buffer Disable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP9</name>
              <description>EP9 TX Double-Packet Buffer Disable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP10</name>
              <description>EP10 TX Double-Packet Buffer Disable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP11</name>
              <description>EP11 TX Double-Packet Buffer Disable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP12</name>
              <description>EP12 TX Double-Packet Buffer Disable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP13</name>
              <description>EP13 TX Double-Packet Buffer Disable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP14</name>
              <description>EP14 TX Double-Packet Buffer Disable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP15</name>
              <description>EP15 TX Double-Packet Buffer Disable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPC</name>
          <description>USB External Power Control</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>USB_EPC_EPEN</name>
              <description>External Power Supply Enable Configuration</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_LOW</name>
                  <description>Power Enable Active Low</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_HIGH</name>
                  <description>Power Enable Active High</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBLOW</name>
                  <description>Power Enable High if VBUS Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_EPEN_VBHIGH</name>
                  <description>Power Enable High if VBUS High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USB_EPC_EPENDE</name>
              <description>EPEN Drive Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTEN</name>
              <description>Power Fault Input Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTSEN_HIGH</name>
              <description>Power Fault Sense</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTAEN</name>
              <description>Power Fault Action Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_EPC_PFLTACT</name>
              <description>Power Fault Action</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_UNCHG</name>
                  <description>Unchanged</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_TRIS</name>
                  <description>Tristate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_LOW</name>
                  <description>Low</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB_EPC_PFLTACT_HIGH</name>
                  <description>High</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCRIS</name>
          <description>USB External Power Control Raw Interrupt Status</description>
          <addressOffset>0x00000404</addressOffset>
          <fields>
            <field>
              <name>USB_EPCRIS_PF</name>
              <description>USB Power Fault Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCIM</name>
          <description>USB External Power Control Interrupt Mask</description>
          <addressOffset>0x00000408</addressOffset>
          <fields>
            <field>
              <name>USB_EPCIM_PF</name>
              <description>USB Power Fault Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EPCISC</name>
          <description>USB External Power Control Interrupt Status and Clear</description>
          <addressOffset>0x0000040C</addressOffset>
          <fields>
            <field>
              <name>USB_EPCISC_PF</name>
              <description>USB Power Fault Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIM</name>
          <description>USB Device RESUME Interrupt Mask</description>
          <addressOffset>0x00000414</addressOffset>
          <fields>
            <field>
              <name>USB_DRIM_RESUME</name>
              <description>RESUME Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRISC</name>
          <description>USB Device RESUME Interrupt Status and Clear</description>
          <addressOffset>0x00000418</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_DRISC_RESUME</name>
              <description>RESUME Interrupt Status and Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
